Import the necessary libraries

In [1]:
import pandas as pd

Import the dataset from this(https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

Use sep= "|" while reading the data

In [2]:
path = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'
users = pd.read_csv(path, sep="|")     #assigned name users
users

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

Assign it to a variable called users and use the 'user_id' as index

In [3]:
users=users.set_index("user_id")
users

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

See the first 10 and last 10 entries

FIRST 10 ENTRIES-

In [4]:
users.head(10)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703

LAST 10 ENTRIES

In [5]:
users.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

What is the number of observations in the dataset?

In [6]:
number_of_obs = len(users)
print("Number of observations-", number_of_obs)

Number of observations- 943

What is the number of columns in the dataset?

In [7]:
number_of_columns = len(users.columns)
print("Number of Columns-", number_of_columns)

Number of Columns- 4

Print the name of all the columns.

In [8]:
c = users.columns
print(c)

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

How is the dataset indexed?

In [9]:
users.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

What is the data type of each column?

In [10]:
datatypes = users.dtypes
print(datatypes)

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

Print only the occupation column

In [11]:
occ = users.occupation
print(occ)

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

How many different occupations are in this dataset?

In [12]:
len(users.occupation.value_counts())

21

What is the most frequent occupation?

In [17]:
users.occupation.mode()

0    student
dtype: object

DataFrame Info.

In [18]:
users.describe

<bound method NDFrame.describe of          age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]>

Describe all the columns

In [24]:
users.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

Summarize only the occupation column

In [30]:
users.occupation.value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

What is the mean age of users?

In [31]:
users.age.mean()

34.05196182396607

What is the age with least occurrence?

In [38]:
users.age.min()

7